{"custom_id": "img-0-1769990412", "method": "POST", "request": {"contents": [{"parts": [{"text": "\n    Style: Hyper-vibrant 3D Chibi/Pixar style with exaggerated expressions and cinematic colors.\n    \n    Subject: **Visual Prompt:**\n\n> \"A hyper-detailed 3D digital illustration in a vibrant **Y2K aesthetic (Year 2000 futurism)**. The scene is set inside a luxury bathroom with curved chrome walls, frosted glass tiles, and neon blue LED accents. \n> \n> In the center, a sleek, organic-looking chrome faucet called **'Grifo-Cilio'** is wide open, pouring a thick, glowing neon blue gel (aqueous humor) into a deep, translucent sink basin. The drain at the bottom, known as the **'Malla-Tra'**, is a complex metallic mesh that is visibly clogged with a mess of iridescent Y2K glitter and holographic star stickers, preventing the gel from entering the **'Canal de Slim'** (a translucent pipe visible beneath the sink). \n> \n> Submerged at the back of the basin is **'Don Nervio'**, a small Chibi-style DJ character wearing iconic **year 2000** fashion: extremely wide-leg baggy 'JNCO' style pants, a chunky silver tech-visor, and oversized headphones. The neon gel has risen to a dangerous level, creating intense **'Presión de la Fiesta'** (Party Pressure); the liquid is visibly pushing and flattening the distressed Chibi DJ against the back wall of the sink. \n> \n> The lighting is a mix of 'Cyber-Blue' and 'Bubblegum Pink' highlights. The textures are high-gloss, with realistic liquid physics, air bubbles trapped in the gel, and a nostalgic, tech-optimistic atmosphere of the early 2000s. 8k resolution, Unreal Engine 5 render style, macro photography depth of field.\"\n\n***\n\n### Key Visual Elements & Consistency:\n\n*   **Theme (2000):** The prompt emphasizes the \"Y2K aesthetic\" through specific fashion (baggy pants, silver visors), materials (chrome, frosted glass), and color palettes (neon blue and silver) typical of the \"Frutiger Aero\" and \"Cybercore\" transitions of that era.\n*   **Grifo-Cilio (Ciliary Body):** Depicted as the source—a faucet—maintaining the physiological logic of continuous production.\n*   **Malla-Tra (Trabecular Meshwork):** Shown as a physical filter being blocked, which is the primary cause of pressure in open-angle glaucoma.\n*   **Don Nervio (Optic Nerve):** His \"Chibi\" design ensures he looks like a sympathetic victim, while his clothing anchors the Year 2000 theme.\n*   **The Gel (Aqueous Humor):** The neon blue color makes it the visual focus, representing the fluid that builds the **Presión Intraocular (PIO)**.. \n     Follow the style/aesthetic of '2000'.\n    Composition: A single cohesive scene. High quality, detailed."}]}], "generation_config": {"image_config": {"aspect_ratio": "4:3"}}}}
{"custom_id": "img-1-1769990412", "method": "POST", "request": {"contents": [{"parts": [{"text": "\n    Style: Hyper-vibrant 3D Chibi/Pixar style with exaggerated expressions and cinematic colors.\n    \n    Subject: **Visual Prompt for Image Generation:**\n\n\"A high-definition, hyper-stylized digital illustration in a **vivid Year 2000 (Y2K) aesthetic**, depicting a scene inside a futuristic neon nightclub. \n\nThe central character, **'Glau'**, is a stylish woman with a frosted-tip hairstyle, wearing a **shimmering silver sequined mesh top (representing the Trabecular Meshwork)**. Upon close inspection, tiny microscopic particles of iridescent glitter are visibly clogging the gaps in the fabric. She is wearing **two pairs of blue-tinted, wraparound futuristic sunglasses** perched on her face (representing bilateral involvement) and large, glowing **wireless 'Silent Disco' headphones** over her ears, emphasizing the silent, painless nature of the scene.\n\nThe background features a **VIP lounge entrance wide open in a distinct 'V' shape (representing the Open Angle)**, through which a crowded dance floor is visible but stagnant. The entire image is framed through a **circular 'Tunnel' effect created by stacked, iridescent 1990s/2000s Compact Discs (CDs)**, blurring and darkening the periphery while keeping only the center in sharp focus to represent 'Tunnel Vision.'\n\nThe lighting is dominated by **neon cyan, hot pink, and ultraviolet glows**, with lens flares and a slight 'fisheye' camera lens effect typical of **year 2000 music videos**. The atmosphere is a blend of high-tech futurism and retro-digital textures, with high contrast and sharp details on the texture of the clogged mesh and the reflective surfaces of the CDs.\". \n     Follow the style/aesthetic of '2000'.\n    Composition: A single cohesive scene. High quality, detailed."}]}], "generation_config": {"image_config": {"aspect_ratio": "4:3"}}}}
{"custom_id": "img-2-1769990412", "method": "POST", "request": {"contents": [{"parts": [{"text": "\n    Style: Hyper-vibrant 3D Chibi/Pixar style with exaggerated expressions and cinematic colors.\n    \n    Subject: **Visual Prompt for Image Generation:**\n\n\"A high-definition, dramatic digital illustration in a **vibrant Y2K aesthetic (Year 2000)**. The scene features 'Don Agudo,' a man in his late 40s with iconic **bleached frosted tips** and a shiny silver tracksuit, agonizing in his bedroom. \n\nThe room is a shrine to the **year 2000**: filled with **translucent 'Bondi Blue' plastic electronics**, a bulky **CRT television** displaying distorted, glitchy psychedelic **rainbow halos**, and a large **glowing crystal lava lamp** on the nightstand. \n\n**Central Visual Metaphor:** A giant, semi-transparent **spectral silver 'nail'** is seen levitating, its point pressing directly into Don Agudo’s right eye to represent the 'dolor de clavo.' His affected eye is **bloodshot red** with a **fixed, mid-dilated pupil (midriasis)** that does not react to the neon glow of the room. \n\n**The Details:** In the background, heavy **purple velvet curtains** (representing the iris) are tangled and stuck against the glass of the lava lamp (the lens), visibly blocking the flow of **fluorescent neon-green liquid** (humor acuoso). Don Agudo is hunched over, one hand clutching his head in pain and the other reaching for a **brushed-metal silver bucket** on the floor. \n\n**Style:** Sharp focus, cinematic lighting, saturated neon colors (lime green, electric blue, and hot pink), and the glossy, futuristic-retro texture characteristic of the **Frutiger Aero/Y2K era**.\". \n     Follow the style/aesthetic of '2000'.\n    Composition: A single cohesive scene. High quality, detailed."}]}], "generation_config": {"image_config": {"aspect_ratio": "4:3"}}}}
{"custom_id": "img-3-1769990412", "method": "POST", "request": {"contents": [{"parts": [{"text": "\n    Style: Hyper-vibrant 3D Chibi/Pixar style with exaggerated expressions and cinematic colors.\n    \n    Subject: **Visual Prompt:**\n\nA high-energy, vibrant digital illustration in the iconic **Y2K Retro-Futurism aesthetic (Year 2000 theme)**, depicting the \"Cyber-Copa 2000\" dance tournament. \n\nIn the center of a circular, glowing neon dance floor, the protagonist **\"Don Disco\"** is frozen in a dynamic dance move. He is wearing a metallic silver puffer vest and translucent blue visor. Around his waist is a massive, thick, vibrant orange-red inflatable ring (representing the **Optic Disc/Neuroretinal Rim**). \n\nInside the central hole of the donut sits **\"Copa-Bot,\"** a sleek, polished white spherical robot that emits a blindingly bright white light (representing the **Physiological Cup**). The scene captures the moment of \"Excavation\": thick, solid beams of neon green \"Atmospheric Light Pressure\" (representing **Intraocular Pressure**) are slamming into Don Disco from all sides, compressing the orange ring. \n\nAs a result, the central hole has stretched significantly; **Copa-Bot** has expanded dramatically, now occupying **60% of the total space** within the donut (illustrating a **Cup/Disc ratio > 0.5**). Don Disco looks strained, losing his balance as his \"rim\" of space disappears.\n\n**Visual Style Details:**\n*   **Theme 2000 elements:** Use \"Frutiger Aero\" and \"Cybercore\" influences—glossy plastic textures, chrome surfaces, bubblegum colors (cyan, magenta, and bright orange), and digital grid patterns on the floor.\n*   **Composition:** A high-angle \"fisheye lens\" perspective common in music videos from the year 2000, making the central \"Copa-Bot\" expansion look imposing and clinical.\n*   **Lighting:** Harsh, volumetric stage lasers and a high-contrast glow coming from the center of the robot to emphasize the \"hollowed-out\" look of the excavation. \n*   **Detail:** The texture of the donut floaty should look slightly compressed where the light beams hit it, showing the thinning of the neuroretinal tissue.. \n     Follow the style/aesthetic of '2000'.\n    Composition: A single cohesive scene. High quality, detailed."}]}], "generation_config": {"image_config": {"aspect_ratio": "4:3"}}}}
{"custom_id": "img-4-1769990412", "method": "POST", "request": {"contents": [{"parts": [{"text": "\n    Style: Hyper-vibrant 3D Chibi/Pixar style with exaggerated expressions and cinematic colors.\n    \n    Subject: **Visual Prompt:**\n\n\"A cinematic, high-energy underground rave scene set in the year 2000, capturing the peak 'Y2K Cyber-core' aesthetic. \n\nIn the center of the frame, **DJ Lata-No-Prost** is performing behind glowing neon turntables. He has iconic frosted tips and wears massive, reflective silver wraparound sunglasses. From behind the lenses, his **absurdly long, feather-like eyelashes** (hypertrichosis) curl outward, and his eyes are a deep, **intense dark cocoa brown**. \n\nThe composition is shot through a **heavy fisheye lens**, creating a dramatic **'tunnel vision' effect** where the edges of the image are shrouded in shadow, leaving only the center of the dance floor visible. \n\nTo the left, his friend **'Pila-Carpina'**, dressed in reflective PVC rave gear and neon hair-beads, is seen pulling shut a set of **massive, circular black velvet curtains** that mimic a constricting pupil (miosis). \n\nTo the right, a burly security guard named **'Aceta-Zola'** in a futuristic tactical vest is frantically turning a large industrial wheel valve. He is **draining a glowing lime-green liquid** (aqueous humor) from a translucent tank labeled 'PUNCH' into an floor grate to relieve the pressure. \n\nIn the background, the atmosphere is thick with neon laser beams (electric blue and hot pink). On the floor, several **spheres that look like translucent grey rocks** are scattered, vibrating from the intense bass, symbolizing the 'hard-as-rock' ocular tension. The image has a slight 35mm film grain, high-gloss textures, and the vibrant, metallic color palette characteristic of the turn of the millennium.\". \n     Follow the style/aesthetic of '2000'.\n    Composition: A single cohesive scene. High quality, detailed."}]}], "generation_config": {"image_config": {"aspect_ratio": "4:3"}}}}
{"custom_id": "img-5-1769990412", "method": "POST", "request": {"contents": [{"parts": [{"text": "\n    Style: Hyper-vibrant 3D Chibi/Pixar style with exaggerated expressions and cinematic colors.\n    \n    Subject: This visual prompt is designed to capture the \"Y2K Aesthetic\" while clearly representing the pharmacological metaphors of the story.\n\n### Visual Prompt for Image Generator\n\n**Title:** The Glaucoma Cyber-Café 2000\n\n**Style:** High-detail, vibrant Y2K retro-futurism. Think \"Liquid Architecture,\" translucent plastics, and the fisheye lens look of music videos from the year 2000.\n\n**The Setting:** \nA futuristic year-2000 Cyber-Café with rows of translucent \"Bondi Blue\" iMac G3s and bulky CRT monitors flickering with green matrix code. The floor is flooded with 10 inches of glowing, crystal-clear turquoise liquid (the \"Aqueous\"). The walls are decorated with neon pipes and chrome accents.\n\n**The Characters & Action:**\n1.  **Timo el Granjero (Timolol):** In the mid-ground, a man in neon-stitched denim overalls and a flannel shirt. He is straining to turn a massive chrome valve (the \"faucet\"). His face is slightly red, clutching his chest with one hand to show he is gasping for air (representing the bronchospasm/asthma side effect).\n2.  **Zola la Química (Acetazolamida):** Standing near a wall of transparent pipes, she wears a silver reflective lab coat and yellow tinted bug-eye sunglasses. She is sprinkling glowing white \"magic powder\" from a glass beaker into the pipes to freeze the production of the liquid.\n3.  **Lana la Pro (Latanoprost):** In the foreground, a cool \"skater girl\" with baggy cargo pants and a tech-wear vest. She is performing a trick on a sleek silver skateboard, using the tail of the board to flip open a single, large ornate floor grate (the \"drain\"). She looks relaxed, emphasizing the \"once a day\" easy routine.\n4.  **Cabo Piloto (Pilocarpina):** In the background, a man in a vintage leather flight suit and aviator goggles. He is hanging from two thick industrial ropes connected to heavy velvet curtains that look like a giant iris. He is pulling them wide toward the corners of the room to let the water rush out of the \"angles\" of the café.\n\n**Technical Details:** \n*   **Lighting:** Neon purple and cyan backlighting, high-gloss surfaces, and \"bloom\" effects on the glowing water.\n*   **Composition:** A wide-angle fisheye lens perspective common in the year 2000.\n*   **Color Palette:** Electric blue, lime green, silver, and translucent plastics.\n*   **Atmosphere:** High energy, \"Emergency Retro\" vibe, chaotic but heroic.\n\n**Keywords:** Y2K aesthetic, year 2000, translucent plastic, cyber-café, medical metaphor, liquid textures, hyper-detailed, 8k, cinematic lighting.. \n     Follow the style/aesthetic of '2000'.\n    Composition: A single cohesive scene. High quality, detailed."}]}], "generation_config": {"image_config": {"aspect_ratio": "4:3"}}}}
